IdeaRS.Connections
GeneralWeldData Properties
Compatible with IDEA StatiCa 0.0
The GeneralWeldData type exposes the following members.
Properties
Name | Description
IsActive |  (Inherited from ConnectionCmdData.)
Name
 Gets or set the name
 (Inherited from ConnectionCmdData.)
OperationId
 Gets or sets the identifier of the operation in the manufacturer sequence
 (Inherited from ConnectionCmdData.)
SurfaceEdgeInx
Weld
 Gets or sets the properties of the connected member to plate weld
WeldedEdgeIndexes
WeldedEdgeInx
WeldedMemberEdgePath
WeldedMemberSurfacePath
WeldedPlateEdgePath
WeldedPlateSurfacePath
WeldPlacement
Top
See Also
Reference
GeneralWeldData Class
IdeaRS.Connections.Data Namespace